cases/ansys_verification/VMFL064/case/0/U
FoamFile { version 2.0; format ascii; class volVectorField; object U; }
// VMFL064: inlet velocity 0.288462 m/s (VM2026R1 p.195). With rho=1, mu=1.5e-5,
// D = 2*h_in = 0.0104 m this gives Re = 1*0.288462*0.0104/1.5e-5 = 200.00 exactly.
// The manual states a UNIFORM inlet and relies on the 200 mm inlet section to
// develop the profile; laminar entry length 0.05*Re*Dh = 0.104 m < 0.200 m, so
// the flow IS fully developed at the step, as the manual asserts.
dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0 0 0);
boundaryField
{
    inlet        { type fixedValue; value uniform (0.288462 0 0); }
    outlet       { type zeroGradient; }
    bottomWall   { type noSlip; }
    stepWall     { type noSlip; }
    topWall      { type noSlip; }
    upstreamWall { type noSlip; }
    frontAndBack { type empty; }
}
