cases/ansys_verification/VMFL064/case/0/p
FoamFile { version 2.0; format ascii; class volScalarField; object p; }
dimensions      [0 2 -2 0 0 0 0];   // kinematic pressure, rho = 1 kg/m3
internalField   uniform 0;
boundaryField
{
    inlet        { type zeroGradient; }
    outlet       { type fixedValue; value uniform 0; }
    bottomWall   { type zeroGradient; }
    stepWall     { type zeroGradient; }
    topWall      { type zeroGradient; }
    upstreamWall { type zeroGradient; }
    frontAndBack { type empty; }
}
